Revit 2027 API
NumberingSchema.GetMinimumNumberOfDigits Method
Note: This API is now obsolete.
 Returns the minimum number of digits to be used for formating the Number parameter of all enumerable elements of the given document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This method is deprecated in Revit 2027 and may be removed in a later version of Revit. This function works only for Rebar, Reinforcement and Coupler elements, an exception will be generated if invoked on numbering schemas that scope other categories. <p>The generic functionality for this was moved in the NumberingFormatSettings.</p>")]
public static int GetMinimumNumberOfDigits(
	Document document
)
<ObsoleteAttribute("This method is deprecated in Revit 2027 and may be removed in a later version of Revit. This function works only for Rebar, Reinforcement and Coupler elements, an exception will be generated if invoked on numbering schemas that scope other categories. <p>The generic functionality for this was moved in the NumberingFormatSettings.</p>")>
Public Shared Function GetMinimumNumberOfDigits (
	document As Document
) As Integer
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2027 and may be removed in a later version of Revit. This function works only for Rebar, Reinforcement and Coupler elements, an exception will be generated if invoked on numbering schemas that scope other categories. <p>The generic functionality for this was moved in the NumberingFormatSettings.</p>")]
static int GetMinimumNumberOfDigits(
	Document^ document
)
[<ObsoleteAttribute("This method is deprecated in Revit 2027 and may be removed in a later version of Revit. This function works only for Rebar, Reinforcement and Coupler elements, an exception will be generated if invoked on numbering schemas that scope other categories. <p>The generic functionality for this was moved in the NumberingFormatSettings.</p>")>]
static member GetMinimumNumberOfDigits :
        document : Document -> int
Parameters
document Document
 The document this value is going to be applied to.
Return Value
Int32
 The current number of formatting digits
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
The number is used by all numbering schemas in the document.
The value can be modified by using the SetMinimumNumberOfDigits(Document, Int32) method.
See Also
Reference
NumberingSchema Class
Autodesk.Revit.DB Namespace